; domain
(define (domain elevators-sequencedstrips)
  (:requirements :typing :action-costs)
  (:types 	elevator - object
			slow-elevator fast-elevator - elevator
   			passenger - object
          	count - object
         )

(:predicates
	(passenger-at ?person - passenger ?floor - count)
	(boarded ?person - passenger ?lift - elevator)
	(lift-at ?lift - elevator ?floor - count)
	(reachable-floor ?lift - elevator ?floor - count)
	(above ?floor1 - count ?floor2 - count)
	(passengers ?lift - elevator ?n - count)
	(can-hold ?lift - elevator ?n - count)
	(next ?n1 - count ?n2 - count)
)

(:functions (total-cost) - number
            (travel-slow ?f1 - count ?f2 - count) - number
            (travel-fast ?f1 - count ?f2 - count) - number
)

(:action move-up-slow
  :parameters (?lift - slow-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f1 ?f2 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-slow ?f1 ?f2))))

(:action move-down-slow
  :parameters (?lift - slow-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f2 ?f1 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-slow ?f2 ?f1))))

(:action move-up-fast
  :parameters (?lift - fast-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f1 ?f2 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-fast ?f1 ?f2))))

(:action move-down-fast
  :parameters (?lift - fast-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f2 ?f1 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-fast ?f2 ?f1))))

(:action board
  :parameters (?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and  (lift-at ?lift ?f) (passenger-at ?p ?f) (passengers ?lift ?n1) (next ?n1 ?n2) (can-hold ?lift ?n2) )
  :effect (and (not (passenger-at ?p ?f)) (boarded ?p ?lift) (not (passengers ?lift ?n1)) (passengers ?lift ?n2) ))

(:action leave
  :parameters (?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and  (lift-at ?lift ?f) (boarded ?p ?lift) (passengers ?lift ?n1) (next ?n2 ?n1) )
  :effect (and (passenger-at ?p ?f) (not (boarded ?p ?lift)) (not (passengers ?lift ?n1)) (passengers ?lift ?n2) ))

)

; problem
; 7 floors, area size: 2, areas: 3, passengers: 6
(define (problem elevators)
(:domain elevators-sequencedstrips)
    (:objects
       n0 n1 n2 n3 n4 n5 n6 - count
       p0 p1 p2 p3 p4 p5 - passenger
       fast0 - fast-elevator
       slow0-0 slow1-0 slow2-0 - slow-elevator
    )

    (:init
       (next n0 n1)
       (next n1 n2)
       (next n2 n3)
       (next n3 n4)
       (next n4 n5)
       (next n5 n6)

       (above n0 n1)
       (above n0 n2)
       (above n0 n3)
       (above n0 n4)
       (above n0 n5)
       (above n0 n6)
       (above n1 n2)
       (above n1 n3)
       (above n1 n4)
       (above n1 n5)
       (above n1 n6)
       (above n2 n3)
       (above n2 n4)
       (above n2 n5)
       (above n2 n6)
       (above n3 n4)
       (above n3 n5)
       (above n3 n6)
       (above n4 n5)
       (above n4 n6)
       (above n5 n6)

       (lift-at fast0 n4)
       (passengers fast0 n0)
       (can-hold fast0 n1) (can-hold fast0 n2) (can-hold fast0 n3)
       (reachable-floor fast0 n0) (reachable-floor fast0 n1) (reachable-floor fast0 n2) (reachable-floor fast0 n3) (reachable-floor fast0 n4) (reachable-floor fast0 n5) (reachable-floor fast0 n6)
    
       (lift-at slow0-0 n0)
       (passengers slow0-0 n0)
       (can-hold slow0-0 n1) (can-hold slow0-0 n2)
       (reachable-floor slow0-0 n0) (reachable-floor slow0-0 n1) (reachable-floor slow0-0 n2)
    
       (lift-at slow1-0 n4)
       (passengers slow1-0 n0)
       (can-hold slow1-0 n1) (can-hold slow1-0 n2)
       (reachable-floor slow1-0 n2) (reachable-floor slow1-0 n3) (reachable-floor slow1-0 n4)
    
       (lift-at slow2-0 n6)
       (passengers slow2-0 n0)
       (can-hold slow2-0 n1) (can-hold slow2-0 n2)
       (reachable-floor slow2-0 n4) (reachable-floor slow2-0 n5) (reachable-floor slow2-0 n6)
    

       (passenger-at p0 n3)
       (passenger-at p1 n5)
       (passenger-at p2 n3)
       (passenger-at p3 n1)
       (passenger-at p4 n1)
       (passenger-at p5 n3)

       (= (travel-slow n0 n1) 6)
       (= (travel-slow n0 n2) 7)
       (= (travel-slow n1 n2) 6)
       (= (travel-slow n2 n3) 6)
       (= (travel-slow n2 n4) 7)
       (= (travel-slow n3 n4) 6)
       (= (travel-slow n4 n5) 6)
       (= (travel-slow n4 n6) 7)
       (= (travel-slow n5 n6) 6)
       (= (travel-fast n0 n1) 4)
       (= (travel-fast n0 n2) 7)
       (= (travel-fast n0 n3) 10)
       (= (travel-fast n0 n4) 13)
       (= (travel-fast n0 n5) 16)
       (= (travel-fast n0 n6) 19)
       (= (travel-fast n1 n2) 4)
       (= (travel-fast n1 n3) 7)
       (= (travel-fast n1 n4) 10)
       (= (travel-fast n1 n5) 13)
       (= (travel-fast n1 n6) 16)
       (= (travel-fast n2 n3) 4)
       (= (travel-fast n2 n4) 7)
       (= (travel-fast n2 n5) 10)
       (= (travel-fast n2 n6) 13)
       (= (travel-fast n3 n4) 4)
       (= (travel-fast n3 n5) 7)
       (= (travel-fast n3 n6) 10)
       (= (travel-fast n4 n5) 4)
       (= (travel-fast n4 n6) 7)
       (= (travel-fast n5 n6) 4)

       (= (total-cost) 0)
    )

    (:goal (and
       (passenger-at p0 n1)
       (passenger-at p1 n1)
       (passenger-at p2 n1)
       (passenger-at p3 n5)
       (passenger-at p4 n5)
       (passenger-at p5 n0)
    ))

    (:metric minimize (total-cost))
)

; plan
1. (move-down-fast fast0 n4 n3)
   deleted: (lift-at fast0 n4)
   added: (lift-at fast0 n3)
   goals met: 0 of 6
2. (board p5 fast0 n3 n0 n1)
   deleted: (passenger-at p5 n3) (passengers fast0 n0)
   added: (boarded p5 fast0) (passengers fast0 n1)
   goals met: 0 of 6
3. (board p2 fast0 n3 n1 n2)
   deleted: (passenger-at p2 n3) (passengers fast0 n1)
   added: (boarded p2 fast0) (passengers fast0 n2)
   goals met: 0 of 6
4. (board p0 fast0 n3 n2 n3)
   deleted: (passenger-at p0 n3) (passengers fast0 n2)
   added: (boarded p0 fast0) (passengers fast0 n3)
   goals met: 0 of 6
5. (move-down-fast fast0 n3 n0)
   deleted: (lift-at fast0 n3)
   added: (lift-at fast0 n0)
   goals met: 0 of 6
6. (leave p5 fast0 n0 n3 n2)
   deleted: (boarded p5 fast0) (passengers fast0 n3)
   added: (passenger-at p5 n0) (passengers fast0 n2)
   goals met: 1 of 6
7. (move-up-fast fast0 n0 n1)
   deleted: (lift-at fast0 n0)
   added: (lift-at fast0 n1)
   goals met: 1 of 6
8. (leave p2 fast0 n1 n2 n1)
   deleted: (boarded p2 fast0) (passengers fast0 n2)
   added: (passenger-at p2 n1) (passengers fast0 n1)
   goals met: 2 of 6
9. (leave p0 fast0 n1 n1 n0)
   deleted: (boarded p0 fast0) (passengers fast0 n1)
   added: (passenger-at p0 n1) (passengers fast0 n0)
   goals met: 3 of 6
10. (board p3 fast0 n1 n0 n1)
   deleted: (passenger-at p3 n1) (passengers fast0 n0)
   added: (boarded p3 fast0) (passengers fast0 n1)
   goals met: 3 of 6
11. (board p4 fast0 n1 n1 n2)
   deleted: (passenger-at p4 n1) (passengers fast0 n1)
   added: (boarded p4 fast0) (passengers fast0 n2)
   goals met: 3 of 6
12. (move-up-fast fast0 n1 n5)
   deleted: (lift-at fast0 n1)
   added: (lift-at fast0 n5)
   goals met: 3 of 6
13. (board p1 fast0 n5 n2 n3)
   deleted: (passenger-at p1 n5) (passengers fast0 n2)
   added: (boarded p1 fast0) (passengers fast0 n3)
   goals met: 3 of 6
14. (leave p3 fast0 n5 n3 n2)
   deleted: (boarded p3 fast0) (passengers fast0 n3)
   added: (passenger-at p3 n5) (passengers fast0 n2)
   goals met: 4 of 6
15. (leave p4 fast0 n5 n2 n1)
   deleted: (boarded p4 fast0) (passengers fast0 n2)
   added: (passenger-at p4 n5) (passengers fast0 n1)
   goals met: 5 of 6
16. (move-down-fast fast0 n5 n1)
   deleted: (lift-at fast0 n5)
   added: (lift-at fast0 n1)
   goals met: 5 of 6
17. (leave p1 fast0 n1 n1 n0)
   deleted: (boarded p1 fast0) (passengers fast0 n1)
   added: (passenger-at p1 n1) (passengers fast0 n0)
   goals met: 6 of 6
